####################################################
#                   문제 요구사항 요약                  #
####################################################
# 출처: https://www.acmicpc.net/problem/11399
# 분류: 그리디 알고리즘, 정렬
# 문제: 줄 서 있는 사람 수 N과, 각 사람이 돈을 인출하는데 걸리는 시간 Pi가 주어졌을 때, 각 사람이 돈을 인출하는데 필요한 시간의 합의 최솟값 구하기
# 접근: Pi 오름차순 정렬하기. 각 위치별로 반복 덧셈되는 점 고려해서 곱셈 처리하기


####################################################
#                     작성한 풀이                     #
####################################################
N = int(input())
P = list(map(int, input().split()))
P.sort()
times = [P[i]*(N-i) for i in range(N)]
print(sum(times))


####################################################
#                    기억해둘 부분                    #
####################################################
